; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-5-13)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	p0-1 - location
	p0-4 - location
	p0-5 - location
	p1-0 - location
	p1-5 - location
	p1-7 - location
	p2-6 - location
	p3-5 - location
	p3-8 - location
	p4-6 - location
	p5-8 - location
	p6-3 - location
	p7-3 - location
	p8-1 - location
	p8-2 - location
	p8-6 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s4)
	(at driver3 s3)
	(at driver4 s2)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s7)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s5)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s2)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s4)
	(at package2 s7)
	(at package3 s6)
	(at package4 s8)
	(at package5 s6)
	(at package6 s6)
	(at package7 s8)
	(at package8 s0)
	(at package9 s2)
	(at package10 s0)
	(at package11 s1)
	(at package12 s2)
	(at package13 s5)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s3 p3-8)
	(path p3-8 s3)
	(path s8 p3-8)
	(path p3-8 s8)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(path s8 p8-6)
	(path p8-6 s8)
	(path s6 p8-6)
	(path p8-6 s6)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 15)
	(= (time-to-drive s3 s0) 15)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 66)
	(= (time-to-drive s5 s0) 66)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 8)
	(= (time-to-drive s8 s0) 8)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 92)
	(= (time-to-drive s0 s1) 92)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 61)
	(= (time-to-drive s4 s1) 61)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 30)
	(= (time-to-drive s6 s1) 30)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 19)
	(= (time-to-drive s7 s1) 19)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 36)
	(= (time-to-drive s0 s2) 36)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 25)
	(= (time-to-drive s4 s2) 25)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 18)
	(= (time-to-drive s5 s2) 18)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 81)
	(= (time-to-drive s7 s2) 81)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 14)
	(= (time-to-drive s1 s3) 14)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 77)
	(= (time-to-drive s7 s3) 77)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 59)
	(= (time-to-drive s7 s4) 59)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 12)
	(= (time-to-drive s8 s4) 12)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 8)
	(= (time-to-drive s4 s5) 8)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 91)
	(= (time-to-drive s6 s5) 91)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 32)
	(= (time-to-drive s8 s5) 32)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 69)
	(= (time-to-drive s3 s6) 69)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 88)
	(= (time-to-drive s6 s7) 88)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 63)
	(= (time-to-drive s8 s7) 63)
	(link s8 s1)
	(link s1 s8)
	(= (time-to-drive s8 s1) 84)
	(= (time-to-drive s1 s8) 84)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 33)
	(= (time-to-drive s2 s8) 33)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver3 s8)
	(at truck4 s0)
	(at package1 s8)
	(at package2 s3)
	(at package3 s7)
	(at package4 s1)
	(at package5 s4)
	(at package6 s6)
	(at package7 s5)
	(at package8 s6)
	(at package9 s2)
	(at package10 s4)
	(at package11 s0)
	(at package12 s7)
	(at package13 s4)
	))

(:metric minimize (+ (* 1 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (walk driver1 s3 p3-5)
   deleted: (at driver1 s3)
   added: (at driver1 p3-5)
   goals met: 2 of 16
2. (load-truck package12 truck5 s2)
   deleted: (at package12 s2)
   added: (in package12 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 2 of 16
3. (walk driver3 s3 p3-8)
   deleted: (at driver3 s3)
   added: (at driver3 p3-8)
   goals met: 2 of 16
4. (walk driver3 p3-8 s8)
   deleted: (at driver3 p3-8)
   added: (at driver3 s8)
   goals met: 3 of 16
5. (load-truck package13 truck4 s5)
   deleted: (at package13 s5)
   added: (in package13 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 3 of 16
6. (walk driver1 p3-5 s5)
   deleted: (at driver1 p3-5)
   added: (at driver1 s5)
   goals met: 3 of 16
7. (board-truck driver1 truck4 s5)
   deleted: (at driver1 s5) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 3 of 16
8. (unload-truck package12 truck5 s2)
   deleted: (in package12 truck5)
   added: (at package12 s2)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 3 of 16
9. (drive-truck truck4 s5 s2 driver1)
   deleted: (at truck4 s5)
   added: (at truck4 s2)
   changed: (fuel-used) from 0 to 198
   goals met: 3 of 16
10. (load-truck package12 truck4 s2)
   deleted: (at package12 s2)
   added: (in package12 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 3 of 16
11. (drive-truck truck4 s2 s8 driver1)
   deleted: (at truck4 s2)
   added: (at truck4 s8)
   changed: (fuel-used) from 198 to 627
   goals met: 3 of 16
12. (load-truck package4 truck4 s8)
   deleted: (at package4 s8)
   added: (in package4 truck4)
   changed: (load truck4) from 2 to 3, (fuel-per-minute truck4) from 13 to 16
   goals met: 3 of 16
13. (load-truck package7 truck4 s8)
   deleted: (at package7 s8)
   added: (in package7 truck4)
   changed: (load truck4) from 3 to 4, (fuel-per-minute truck4) from 16 to 20
   goals met: 3 of 16
14. (drive-truck truck4 s8 s0 driver1)
   deleted: (at truck4 s8)
   added: (at truck4 s0)
   changed: (fuel-used) from 627 to 787
   goals met: 4 of 16
15. (load-truck package8 truck4 s0)
   deleted: (at package8 s0)
   added: (in package8 truck4)
   changed: (load truck4) from 4 to 5, (fuel-per-minute truck4) from 20 to 25
   goals met: 4 of 16
16. (load-truck package10 truck4 s0)
   deleted: (at package10 s0)
   added: (in package10 truck4)
   changed: (load truck4) from 5 to 6, (fuel-per-minute truck4) from 25 to 31
   goals met: 4 of 16
17. (drive-truck truck4 s0 s1 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (fuel-used) from 787 to 3639
   goals met: 3 of 16
18. (unload-truck package4 truck4 s1)
   deleted: (in package4 truck4)
   added: (at package4 s1)
   changed: (load truck4) from 6 to 5, (fuel-per-minute truck4) from 31 to 25
   goals met: 4 of 16
19. (load-truck package11 truck4 s1)
   deleted: (at package11 s1)
   added: (in package11 truck4)
   changed: (load truck4) from 5 to 6, (fuel-per-minute truck4) from 25 to 31
   goals met: 4 of 16
20. (drive-truck truck4 s1 s0 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (fuel-used) from 3639 to 6491
   goals met: 5 of 16
21. (unload-truck package11 truck4 s0)
   deleted: (in package11 truck4)
   added: (at package11 s0)
   changed: (load truck4) from 6 to 5, (fuel-per-minute truck4) from 31 to 25
   goals met: 6 of 16
22. (drive-truck truck4 s0 s5 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s5)
   changed: (fuel-used) from 6491 to 8141
   goals met: 5 of 16
23. (unload-truck package7 truck4 s5)
   deleted: (in package7 truck4)
   added: (at package7 s5)
   changed: (load truck4) from 5 to 4, (fuel-per-minute truck4) from 25 to 20
   goals met: 6 of 16
24. (drive-truck truck4 s5 s4 driver1)
   deleted: (at truck4 s5)
   added: (at truck4 s4)
   changed: (fuel-used) from 8141 to 8301
   goals met: 6 of 16
25. (load-truck package1 truck4 s4)
   deleted: (at package1 s4)
   added: (in package1 truck4)
   changed: (load truck4) from 4 to 5, (fuel-per-minute truck4) from 20 to 25
   goals met: 6 of 16
26. (unload-truck package10 truck4 s4)
   deleted: (in package10 truck4)
   added: (at package10 s4)
   changed: (load truck4) from 5 to 4, (fuel-per-minute truck4) from 25 to 20
   goals met: 7 of 16
27. (drive-truck truck4 s4 s7 driver1)
   deleted: (at truck4 s4)
   added: (at truck4 s7)
   changed: (fuel-used) from 8301 to 9481
   goals met: 7 of 16
28. (unload-truck package12 truck4 s7)
   deleted: (in package12 truck4)
   added: (at package12 s7)
   changed: (load truck4) from 4 to 3, (fuel-per-minute truck4) from 20 to 16
   goals met: 8 of 16
29. (load-truck package2 truck4 s7)
   deleted: (at package2 s7)
   added: (in package2 truck4)
   changed: (load truck4) from 3 to 4, (fuel-per-minute truck4) from 16 to 20
   goals met: 8 of 16
30. (drive-truck truck4 s7 s3 driver1)
   deleted: (at truck4 s7)
   added: (at truck4 s3)
   changed: (fuel-used) from 9481 to 11021
   goals met: 8 of 16
31. (unload-truck package2 truck4 s3)
   deleted: (in package2 truck4)
   added: (at package2 s3)
   changed: (load truck4) from 4 to 3, (fuel-per-minute truck4) from 20 to 16
   goals met: 9 of 16
32. (drive-truck truck4 s3 s7 driver1)
   deleted: (at truck4 s3)
   added: (at truck4 s7)
   changed: (fuel-used) from 11021 to 12253
   goals met: 9 of 16
33. (drive-truck truck4 s7 s8 driver1)
   deleted: (at truck4 s7)
   added: (at truck4 s8)
   changed: (fuel-used) from 12253 to 13261
   goals met: 9 of 16
34. (unload-truck package1 truck4 s8)
   deleted: (in package1 truck4)
   added: (at package1 s8)
   changed: (load truck4) from 3 to 2, (fuel-per-minute truck4) from 16 to 13
   goals met: 10 of 16
35. (drive-truck truck4 s8 s4 driver1)
   deleted: (at truck4 s8)
   added: (at truck4 s4)
   changed: (fuel-used) from 13261 to 13417
   goals met: 10 of 16
36. (unload-truck package13 truck4 s4)
   deleted: (in package13 truck4)
   added: (at package13 s4)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 11 of 16
37. (drive-truck truck4 s4 s7 driver1)
   deleted: (at truck4 s4)
   added: (at truck4 s7)
   changed: (fuel-used) from 13417 to 14066
   goals met: 11 of 16
38. (drive-truck truck4 s7 s6 driver1)
   deleted: (at truck4 s7)
   added: (at truck4 s6)
   changed: (fuel-used) from 14066 to 15034
   goals met: 11 of 16
39. (unload-truck package8 truck4 s6)
   deleted: (in package8 truck4)
   added: (at package8 s6)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 12 of 16
40. (load-truck package3 truck4 s6)
   deleted: (at package3 s6)
   added: (in package3 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 12 of 16
41. (load-truck package5 truck4 s6)
   deleted: (at package5 s6)
   added: (in package5 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 12 of 16
42. (drive-truck truck4 s6 s7 driver1)
   deleted: (at truck4 s6)
   added: (at truck4 s7)
   changed: (fuel-used) from 15034 to 16178
   goals met: 12 of 16
43. (drive-truck truck4 s7 s4 driver1)
   deleted: (at truck4 s7)
   added: (at truck4 s4)
   changed: (fuel-used) from 16178 to 16945
   goals met: 12 of 16
44. (unload-truck package5 truck4 s4)
   deleted: (in package5 truck4)
   added: (at package5 s4)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 13 of 16
45. (drive-truck truck4 s4 s2 driver1)
   deleted: (at truck4 s4)
   added: (at truck4 s2)
   changed: (fuel-used) from 16945 to 17220
   goals met: 13 of 16
46. (disembark-truck driver1 truck4 s2)
   deleted: (driving driver1 truck4)
   added: (at driver1 s2) (empty truck4)
   goals met: 14 of 16
47. (board-truck driver1 truck5 s2)
   deleted: (at driver1 s2) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 13 of 16
48. (board-truck driver4 truck4 s2)
   deleted: (at driver4 s2) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 13 of 16
49. (disembark-truck driver1 truck5 s2)
   deleted: (driving driver1 truck5)
   added: (at driver1 s2) (empty truck5)
   goals met: 14 of 16
50. (drive-truck truck4 s2 s7 driver4)
   deleted: (at truck4 s2)
   added: (at truck4 s7)
   changed: (fuel-used) from 17220 to 18111
   goals met: 14 of 16
51. (unload-truck package3 truck4 s7)
   deleted: (in package3 truck4)
   added: (at package3 s7)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 15 of 16
52. (drive-truck truck4 s7 s8 driver4)
   deleted: (at truck4 s7)
   added: (at truck4 s8)
   changed: (fuel-used) from 18111 to 18741
   goals met: 15 of 16
53. (drive-truck truck4 s8 s0 driver4)
   deleted: (at truck4 s8)
   added: (at truck4 s0)
   changed: (fuel-used) from 18741 to 18821
   goals met: 16 of 16
